""" 5. Создать переменную содержащую сторону квадрата, создать новый список,
в котором будут периметр квадрата, площадь кадрата и диоганаль квадрата. """
side_of_square = 5
# my_list2 = [square_perimeter, square_area, square_diagonal]
my_list2 = [side_of_square * 4, side_of_square ** 2, (2 ** .5) * 5]
print(my_list2)
