""" 3.Создать три переменые содержащие возраст трех ваших друзей, в качестве имен переменных
использовать имена друзей, найти сумму и вывести ее на экран """
maxim_age = 31
vladimir_age = 36
oleg_age = 35
summ_of_ages = maxim_age + vladimir_age + oleg_age
print(summ_of_ages)

